privacy_policy_1 = '''
<b>Политика конфиденциальности персональных данных</b>

Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) является публичным Договором, заключенным между владельцем telegram-бота Qtizim  ИП «MINSIZ ALA»  (Продавец) и Покупателем в соответствии со ст.387 Гражданского кодекса Республики Казахстан, основана на Законе Республики Казахстан «О персональных данных и их защите», действует в отношении информации, содержащей персональные данные Покупателей, которую telegram-бот Qtizim https://t.me/qtizim_bot (далее – Telegram-бот) может получить о Покупателях во время пользования ими Telegram-ботом.

1. Определение терминов

1.1. Персональные данные - сведения, относящиеся к определенному или определяемому на их основании субъекту персональных данных, зафиксированные на электронном, бумажном и (или) ином материальном носителе.
1.2. Сбор персональных данных - действия, направленные на получение персональных данных.
1.3. Обработка персональных данных - действия, направленные на накопление, хранение, изменение, дополнение, использование, распространение, обезличивание, блокирование и уничтожение персональных данных.
1.4. Защита персональных данных - комплекс мер, в том числе правовых, организационных и технических, осуществляемых в целях, установленных Законом РК «О персональных данных и их защите».
1.5. Telegram-бот - бот, расположенный кроссплатформенном мессенджере Telegram и имеющий адрес в сети Интернет https://t.me/qtizim_bot, на котором представлены услуги, предлагаемые Покупателям для оформления Заказов, а также условия оплаты и предоставление этих Услуг Покупателям.
1.6. Сервисы Telegram-бота – все услуги, доступные для использования на сайте https://t.me/qtizim_bot.
1.7. Покупатель – пользователь Telegram-бота.
1.8. Продавец – ИП «MINSIZ ALA» , являющееся владельцем Telegram-бота, БИН 780321300145.
1.9. IP-адрес — уникальный сетевой адрес узла в компьютерной сети, построенной по протоколу IP, позволяющий определить местонахождение Покупателя. Telegram-бот не отслеживает местоположение, подробнее чем город и область.


2. Предмет политики конфиденциальности

2.1. Настоящая Политика конфиденциальности устанавливает обязательства Продавца по неразглашению и обеспечению режима защиты конфиденциальности персональных данных, которые Покупатель предоставляет по запросу Продавца при регистрации в Telegram-боте и/или при оформлении заказа для приобретения услуг.
2.2. Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности, предоставляются Покупателем путём старта работы Telegram-бота и включают в себя следующую информацию:
2.2.1. Telegram user ID — цифровой код, который присваивается каждому аккаунту при регистрации в Telegram.
2.3. Любая иная персональная информация неоговоренная выше (история покупок, используемые браузеры и операционные системы и т.д.) также подлежит надежному хранению и нераспространению, за исключением случаев, предусмотренных в п.4.3.2. и п.4.4. настоящей Политики конфиденциальности.
'''

privacy_policy_2 = '''
3. Цели сбора и обработки персональных данных Покупателей


3.1. Продавец собирает, обрабатывает и хранит только те персональные данные, которые необходимы для предоставления Сервисов и/или приобретения Покупателем Товара из каталога Telegram-бота.
3.2. Персональные данные Покупателя Продавец использует в целях:
3.2.1. идентификации Покупателя для оформления заказа и/или заключения Договора купли-продажи товара;
3.2.2. обработки и получения от Покупателя платежей;
3.2.3. предоставления Покупателю услуг;
3.2.4. предоставления Покупателю эффективной клиентской поддержки;
3.2.5. предоставления Покупателю персонализированных Сервисов;
3.2.6. связи с Покупателем, в том числе направление уведомлений, запросов и информации, касающихся использования Сервисов, оказания услуг, а также обработки запросов и заявок от Покупателя;
3.2.7. улучшения качества Сервисов, удобства их использования, разработка новых Сервисов и услуг;
3.2.8. информирования Покупателя о проводимых мероприятиях и акциях;
3.3. Продавец не несет ответственности за сведения, предоставленные Покупателем в Telegram-боте в общедоступной форме.
3.4. Продавец не несет ответственности за убытки, которые Покупатель может понести в результате того, что его логин и пароль стали известны третьему лицу.
'''


privacy_policy_3 = '''
4. Права и обязанности сторон

4.1. Покупатель обязан:
4.1.1. предоставлять информацию о персональных данных, необходимую для пользования Telegram-ботом;
4.1.2. изменять, дополнять предоставленную информацию в случае обнаружения некорректных данных при пользовании Telegram-ботом.
4.2. Покупатель имеет право:
4.2.1. на доступ и редактирование информации о персональных данных в любое время через веб-интерфейс, предоставляемый в рамках сервисов.
4.3. Продавец обязан:
4.3.1. использовать полученную информацию исключительно для целей, указанных в разделе 3 настоящей Политики конфиденциальности;
4.3.2. обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Покупателя переданных персональных данных, за исключением передачи данных в целях выполнения заказа Покупателя (курьерским службам, организациям почтовой связи, банкам и т.п.), а также уполномоченным государственным органам Республики Казахстан в порядке, установленным законодательством РК;
4.3.3. принимать меры предосторожности для защиты конфиденциальности персональных данных Покупателя согласно порядку, обычно используемого для защиты такого рода информации.


5. Прочие условия

5.1. Пользование Покупателем Telegram-ботом означает его безоговорочное согласие с настоящей Политикой конфиденциальности и условиями обработки Продавцом персональных данных Покупателя.
5.2. В случае несогласия с условиями Политики конфиденциальности Покупатель должен прекратить пользование Telegram-ботом.
5.3. Настоящая Политика конфиденциальности применяется только к telegram-боту Qtizim https://t.me/qtizim_bot. Telegram-бот не несет ответственность за сайты третьих лиц, на которые Покупатель может перейти по ссылкам, доступным в Telegram-боте.
5.4. Продавец, в силу специфики способа получения информации, не проверяет достоверность предоставленных Покупателем персональных данных и не осуществляет контроль их актуальности. Однако, Продавец исходит из того, что Покупатель предоставляет достоверные персональные данные и поддерживает эти данные в актуальном состоянии. Всю ответственность, а также возможные последствия за предоставление недостоверных или не актуальных персональных данных несёт Покупатель.
5.5. К настоящей Политике конфиденциальности и отношениям между Покупателем и Продавцом применяется действующее законодательство Республики Казахстан.
5.6. Продавец оставляет за собой право на одностороннее изменение настоящей Политики конфиденциальности для дальнейшего совершенствования системы безопасности в соответствии с действующим законодательством РК.
5.7. Все предложения или вопросы по поводу настоящей Политики конфиденциальности следует сообщать по электронному адресу: minsizala@gmail.com.
5.8. Продавец не несет ответственности за действия третьих лиц, получивших в результате использования Интернета доступ к информации о Покупателе, за последствия использования информации, которая доступна любому пользователю сети Интернет.
'''
pp = (privacy_policy_1, privacy_policy_2, privacy_policy_3)


oferta_1 = '''
<b>ПУБЛИЧНЫЙ ДОГОВОР-ОФЕРТА
Юридического лица ИП «MINSIZ ALA» 
(далее – Исполнитель)</b>

Настоящая публичная оферта (далее – Оферта), является Договором, заключенным между Исполнителем и пользователем услуг - физическим лицом (далее - Заказчик), который определяет условия приобретения и оказания услуг с использованием ресурсов Исполнителя.

ОБЩИЕ ПОЛОЖЕНИЯ

Исполнитель публикует настоящую Оферту с предложением в адрес физических и юридических лиц в соответствии со ст.395, 396 и 447 Гражданского кодекса Республики Казахстан (далее – ГК РК).
Настоящая Оферта, как и любой Договор, определяет существенные условия взаимодействия между Исполнителем и Заказчиком (лицом акцептовавшим Оферту).
Настоящая Оферта заключается между Исполнителем и Заказчиком в момент оформления заказа на оказание услуг.
Оферта может быть принята любым физическим или юридическим лицом на территории Республики Казахстан, имеющим намерение заказать (приобрести) услуги, оказываемые Исполнителем в соответствии с перечнем услуг, указанных в telegram-боте Qtizim https://t.me/qtizim_bot.
Заказчик безоговорочно принимает все условия, содержащиеся в оферте в целом (т.е. в полном объеме и без исключений).
В случае принятия условий настоящей Оферты, физическое или юридическое лицо, становится Заказчиком.
Акцептом является получение Исполнителем сообщения о намерении физического или юридического лица заказать услуги на условиях, предложенных настоящей Офертой.
Оферта, все изменения, приложения к ней, а также вся дополнительная информация об услугах Исполнителя опубликованы в telegram-боте Qtizim https://t.me/qtizim_bot.

СТАТУС САЙТА ИСПОЛНИТЕЛЬА

Telegram-бот является собственностью Исполнителя и предназначен для организации дистанционного способа продажи услуг посредством сети интернет.
Произведя акцепт Оферты (т.е. оплату оформленного в telegram-боте Исполнителя заказа), Заказчик получит услуги на условиях и в порядке, определенном Договором на оказание услуг Исполнителя, размещенного в telegram-боте Qtizim https://t.me/qtizim_bot.
Исполнитель не несет ответственности за содержание и достоверность информации, предоставленной Заказчиком при оформлении заказа на сайте Исполнителя.
'''

oferta_2 = '''
СТАТУС ЗАКАЗЧИКА

Заказчик несет ответственность за достоверность предоставленной при оформлении заказа информации, и ее чистоту от претензий третьих лиц.
Заказчик подтверждает свое согласие с условиями, установленными настоящей Офертой, путем проставления отметки в графе «Условия Договора мною прочитаны полностью, все условия Договора мне понятны, со всеми условиями Договора я согласен» при оформлении заказа.
Информация, предоставленная Заказчиком, является конфиденциальной. Заказчик, предоставляя свои персональные данные, зарегистрировавшись в telegram-боте или заполнении заявки дает своими действиями согласие на обработку его персональных данных в целях исполнения пользовательского соглашения. Исполнитель использует информацию о Заказчике исключительно в целях функционирования Исполнителя (отправление уведомления Заказчиком о выполнении заказа и т.д.) и в случаях, указанных в настоящей Оферте.
Услуги приобретаются Заказчиком исключительно для личных, семейных, домашних нужд, не связанных с осуществлением предпринимательской деятельности. Использование бота (ресурса) Исполнителя для просмотра и выбора услуг, а так же для оформления заказа является для Заказчика безвозмездным.

ПРЕДМЕТ ОФЕРТЫ

Исполнитель, на основании заказов Заказчика, продает последнему услуги в соответствии с условиями и по ценам, установленным Исполнителем на сайте.
Оказание услуг заказанных и оплаченных Заказчиком, осуществляется Исполнителем или третьими лицами, привлеченными Исполнителем для исполнения своих обязательств. 
К отношениям между Заказчиком и Исполнителем применяются положения ГК РК, ЗРК «О защите прав потребителей», а также иные нормативные правовые акты Республики Казахстан, регулирующие указанные в настоящей Оферте права и обязанности Сторон.
Физическое или юридическое лицо считается принявшим все условия Оферты (акцепт) и приложений к ней в полном объеме и без исключений с момента получения Исполнителем сообщения о намерении Заказчика заказать услуги на условиях, предложенных Исполнителем. В случае акцепта Оферты физическое или юридическое лицо считается заключившим с Исполнителем Договор оказания услуг и приобретает статус Заказчика.

ПОРЯДОК ЗАКЛЮЧЕНИЯ ДОГОВОРА КУПЛИ-ПРОДАЖИ

Заказчик может оформить заказ самостоятельно в telegram-боте Исполнителя, либо через специалиста Исполнителя по телефону, указанному на сайте, на условиях Договора оказания услуг.
При оформлении заказа в telegram-боте Исполнителя, Заказчик обязан предоставить следующие данные:
Telegram user ID — цифровой код, который присваивается каждому аккаунту при регистрации.
Волеизъявление Заказчика осуществляется посредством внесения последним соответствующих данных в форму заказа в telegram-боте Исполнителя, либо подачей заявки через специалиста Исполнителя с использованием информационно-телекоммуникационных средств или по электронной почте (e-mail).
Исполнитель не редактирует информацию о Заказчике.
Для получения бумажного экземпляра Договора оказания услуг, Заказчик отправляет заявку по электронной почте или иным способом, согласованным со специалистом Исполнителя по телефону, указанному в telegram-боте Исполнителя.

ИНФОРМАЦИЯ О ТОВАРЕ

Информация об услугах Исполнителя, предоставляются к показу в telegram-боте Исполнителя через графические изображения и информацию, являющиеся собственностью Исполнителя.
Каждое графическое изображение, сопровождается текстовой информацией с наименованием, ценой и описанием услуг.
Все информационные материалы, представленные в telegram-боте Исполнителя, носят справочный характер и не могут в полной мере передавать информацию о свойствах и характеристиках услуг. В случае возникновения у Заказчика вопросов, касающихся свойств и характеристик услуг, Заказчик должен перед оформлением заказа обратиться к специалисту Исполнителя по телефонам указанным в telegram-боте.
По просьбе Заказчика специалист Исполнителя обязан предоставить (по телефону или посредством электронной почты) прочую информацию, необходимую и достаточную, с точки зрения Заказчика, для принятия им решения о заказе услуг.
'''

oferta_3 = '''
ПОРЯДОК ПРИОБРЕТЕНИЯ (ЗАКАЗА) УСЛУГ

Заказчик вправе оформить заказ на любой из видов услуг, предоставленных в telegram-боте Исполнителя. Каждый вид услуги может быть заказан в любом количестве. Исключения из указанного правила указаны в описании каждого вида услуг.
Заказ может быть оформлен Заказчиком по телефонам, указанным в telegram-боте, или оформлен самостоятельно в telegram-боте.
После оформления заказа Исполнитель подтверждает заказ Заказчика путем отправления на e-mail Заказчика информацию, подтверждающую принятие заказа, с указанием наименования, вида и характеристик услуг с указанием общей суммы заказа или специалист Исполнителя связывается с Заказчиком по телефону для уточнения необходимых характеристик услуг.
При невозможности оказания услуги, представленной в telegram-боте Исполнителя, специалист последнего обязан поставить в известность об этом Заказчика (посредством связи по Telegram user ID, указанном при регистрации).
Срок оказания услуги устанавливается по соглашению Сторон и/или определяется Договором об оказании услуг, размещенном в telegram-боте Исполнителя.

ЦЕНА УСЛУГ

Цена указанная в telegram-боте Исполнителя указана в тенге Республики Казахстан.
Указанная в telegram-боте цена может быть изменена Исполнителем в одностороннем порядке, при этом цена на заказанные и оплаченные Заказчиком услуги изменению не подлежит.
Стоимость услуг, предоставляемых Заказчику при их заказе в telegram-боте Исполнителя указана в разделе «Оплата».

ОПЛАТА УСЛУГ

Способы и порядок оплаты указаны в telegram-боте в разделе «Оплата». При необходимости порядок и условия оплаты заказа оговариваются Заказчиком со специалистом Исполнителя.
При наличной форме оплаты Заказчик обязан уплатить Исполнителю цену заказа в момент выставления и передачи Заказчику счета на оплату услуг, путем передачи денег представителю Исполнителя.
Оплата безналичным расчетом производится согласно оформленному счёту в течение 3 (трёх) рабочих дней с даты выставления такого счёта. После поступления денежных средств на счет Исполнителя, специалист Исполнителя согласовывает с Заказчиком сроки оказания услуг. При безналичной форме оплаты обязанность Заказчика по уплате цены заказа считается исполненной с момента зачисления соответствующих денежных средств на расчетный счет, указанный Исполнителем.
Заказчик оплачивает заказ любым способом, доступным в telegram-боте Исполнителя.
Расчеты Сторон при оплате заказа осуществляются в тенге Республики Казахстан.

ВОЗВРАТ ТОВАРА

Заказчик вправе отказаться от услуг в порядке и на условиях, предусмотренных ЗРК «О защите прав потребителей РК». 
Заказчик не вправе отказаться от услуг выполненных (оказанных) надлежащим образом.
При отказе Заказчика от услуг Исполнитель возвращает Заказчику сумму, уплаченную Исполнителем в соответствии с договором, за исключением расходов Исполнителя.

 ОТВЕТСТВЕННОСТЬ СТОРОН

Стороны несут ответственность в соответствии с законодательством РК.
Исполнитель не несет ответственности за ущерб, причиненный Заказчику вследствие ненадлежащего использования им результатов услуг, заказанных в telegram-боте Исполнителя.
Стороны освобождаются от ответственности за неисполнение или ненадлежащее исполнение обязательств по Оферте на время действия обстоятельств непреодолимой силы.
'''

oferta_4 = '''
ПРОЧИЕ УСЛОВИЯ

К отношениям между Заказчиком и Исполнителем применяются нормы, определенные законодательством Республики Казахстан.
При необходимости Исполнитель и Заказчик вправе в любое время оформить договор оказания услуг в форме письменного двухстороннего соглашения, не противоречащего положениям настоящей Оферты.
В случае возникновения вопросов и претензий со стороны Заказчика, последний должен обратиться к Исполнителю по адресу местонахождения Исполнителя ИП «MINSIZ ALA», и/или по номеру телефона: + 7 747 370 8036, в том числе определенным в telegram-боте Исполнителя.
Настоящая Оферта вступает в силу с даты её акцепта Заказчиком и действует до полного исполнения обязательств Сторонами по ней.
Все споры и разногласия, возникающие при исполнении Сторонами обязательств по настоящей Оферте, решаются путем проведения  переговоров, а в случае невозможности их урегулирования посредством переговоров, Стороны имеют право обратиться за разрешением таких споров в судебные органы республики Казахстан по месту нахождения Исполнителя.
Исполнитель оставляет за собой право расширять и сокращать общее предложение услуг в telegram-боте, регулировать доступ к заказе любых услуг, а также приостанавливать или прекращать продажу любых услуг по своему собственному усмотрению.

АДРЕС И РЕКВИЗИТЫ ИСПОЛНИТЕЛЯ

Наименование: ИП “MINSIZ ALA”
Юридический адрес: Республика Казахстан, г. Алматы, ул. Саина, д. 18, оф. 10
Телефон: + 7 747 370 8036
БИН: 780321300145
КБе: 19
р/с в тенге: KZ70722S000040316729
в банке: АО "Kaspi Bank"
БИК: CASPKZKA
'''
oferta = (oferta_1, oferta_2, oferta_3, oferta_4)


payment_1 = '''
Услуга оплаты через интернет осуществляется в соответствии с Правилами международных платежных систем Visa и MasterCard на принципах соблюдения конфиденциальности и безопасности совершения платежа, для чего используются самые современные методы проверки, шифрования и передачи данных по закрытым каналам связи. Ввод данных банковской карты осуществляется на защищенной платежной странице FreedomPay.

На странице для ввода данных банковской карты потребуется ввести номер карты, имя владельца карты, срок действия карты, трёхзначный код безопасности (CVV2 для VISA или CVC2 для MasterCard). Все необходимые данные пропечатаны на самой карте.

Трёхзначный код безопасности — это три цифры, находящиеся на обратной стороне карты.
Далее вы будете перенаправлены на страницу Вашего банка для ввода 3DSecure кода, который придет к Вам в СМС. Если 3DSecure код к Вам не пришел, то следует обратится в банк выдавший Вам карту.
Случаи отказа в совершении платежа:
○ банковская карта не предназначена для совершения платежей через интернет, о чем можно узнать, обратившись в Ваш Банк;
○ недостаточно средств для оплаты на банковской карте. Подробнее о наличии средств на банковской карте Вы можете узнать, обратившись в банк, выпустивший банковскую карту;
○ данные банковской карты введены неверно;
○ истек срок действия банковской карты. Срок действия карты, как правило, указан на лицевой стороне карты (это месяц и год, до которого действительна карта). Подробнее о сроке действия карты Вы можете узнать, обратившись в банк, выпустивший банковскую карту;
'''

payment_2 = '''
По вопросам оплаты с помощью банковской карты и иным вопросам, связанным с работой telegram-бота, Вы можете обращаться по следующему телефону: + 7 747 370 8036.
Предоставляемая вами персональная информация (имя, адрес, телефон, e-mail, номер банковской карты) является конфиденциальной и не подлежит разглашению. Данные вашей кредитной карты передаются только в зашифрованном виде и не сохраняются на Web-сервере Freedom Pay.
Правила возврата товара
При оплате картами возврат наличными денежными средствами не допускается. Порядок возврата регулируется правилами международных платежных систем.
Процедура возврата товара регламентируется статьей 14 закона «О защите прав потребителей».
○ Потребитель вправе отказаться от товара в любое время до его передачи, а после передачи товара - в течение 3 дней;
○ Возврат товара надлежащего качества возможен в случае, если сохранены его товарный вид, потребительские свойства, а также документ, подтверждающий факт и условия покупки указанного товара;
○ Потребитель не вправе отказаться от товара надлежащего качества, имеющего индивидуально-определенные свойства, если указанный товар может быть использован исключительно приобретающим его человеком;
○ При отказе потребителя от товара продавец должен возвратить ему денежную сумму, уплаченную потребителем по договору, за исключением расходов продавца на доставку от потребителя возвращенного товара, не позднее чем через десять дней со дня предъявления потребителем соответствующего требования;

Для возврата денежных средств на банковскую карту необходимо заполнить «Заявление о возврате денежных средств», которое высылается по требованию компанией на электронный адрес и оправить его вместе с приложением копии паспорта по адресу minsizala@gmail.com
Возврат денежных средств будет осуществлен на банковскую карту в течение 21 (двадцати одного) рабочего дня со дня получения «Заявление о возврате денежных средств» Компанией.
Для возврата денежных средств по операциям проведенными с ошибками необходимо обратиться с письменным заявлением и приложением копии паспорта и чеков/квитанций, подтверждающих ошибочное списание. Данное заявление необходимо направить по адресу minsizala@gmail.com
Сумма возврата будет равняться сумме покупки. 
Срок рассмотрения Заявления и возврата денежных средств начинает исчисляться с момента получения Компанией Заявления и рассчитывается в рабочих днях без учета праздников/выходных дней. 
'''

payment_info = (payment_1, payment_2)